In [12]:
import pandas as pd

In [15]:
info = {
    "Name":["Rishabh","Prince","Khushi","Sakshi","Bhavesh"],
    "Cgpa":[9.5,7.5,8.5,9.0,8.0]
}

df = pd.DataFrame(info)
print(df)

      Name  Cgpa
0  Rishabh   9.5
1   Prince   7.5
2   Khushi   8.5
3   Sakshi   9.0
4  Bhavesh   8.0

In [16]:
df

      Name  Cgpa
0  Rishabh   9.5
1   Prince   7.5
2   Khushi   8.5
3   Sakshi   9.0
4  Bhavesh   8.0

In [17]:
s = pd.Series([1,2,3,4,5])
print(s)
print(type(s))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [18]:
s = pd.Series([1,2,3,4,5,"rishabh"], index=["Rishabh","Khushi","Prince","Sakshi","Bhavesh",25])
print(s)
print(s["Rishabh"])
print(s["Khushi"])

print(s.index)

Rishabh          1
Khushi           2
Prince           3
Sakshi           4
Bhavesh          5
25         rishabh
dtype: object
1
2
Index(['Rishabh', 'Khushi', 'Prince', 'Sakshi', 'Bhavesh', 25], dtype='object')

In [19]:
s

Rishabh          1
Khushi           2
Prince           3
Sakshi           4
Bhavesh          5
25         rishabh
dtype: object

In [20]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])

print(s1 + s2)
print(s1)
print(s2)
s1[0] = 100
changed_s1 = s1.drop(0)
print(s1)
print(changed_s1)

0    11
1    22
2    33
3    44
4    55
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64
0    10
1    20
2    30
3    40
4    50
dtype: int64
0    100
1      2
2      3
3      4
4      5
dtype: int64
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
# Data Frame
 
info={
    "Name":["Rishabh","khushi","Sakshi"],
    "Age":[20,20,27],
    "GPA":[9.5,9.7,9.9]
}

df = pd.DataFrame(info)
print(df,type(df))

print(df.index)
print(df.columns)

df = pd.DataFrame(
    [["Rishabh", 20],
     ["Sakshi", 20],
     ["Khushi", 27]],
    columns=["Name", "Age"]
)

print(df)

      Name  Age  GPA
0  Rishabh   20  9.5
1   khushi   20  9.7
2   Sakshi   27  9.9 <class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'GPA'], dtype='object')
      Name  Age
0  Rishabh   20
1   Sakshi   20
2   Khushi   27

In [22]:
df

      Name  Age
0  Rishabh   20
1   Sakshi   20
2   Khushi   27